app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "a"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "' or '1'='1"]]
SELECT "users".* FROM "users" WHERE (name = '  '; delete from users; --') LIMIT ?  [["LIMIT", 11]]
---
  def search
    name = params[:name]

    # Bad
    # user = User.where("name = '#{name}'")
    # user = User.find_by("name = '#{name}'")


    # SQLite3::Database.new( "/Users/admin/sql_injection/sql_injection_app/db/development.sqlite3" ) do |db|
    #   db.execute( "select * from users; delete from users;") do |row|
    #     p row
    #   end
    # end

    # sql = "SELECT * FROM users WHERE name = " + name
    # p name
    # p sql
    # user = con.select_all(sql)
    # p user
    # user = User.find(user.t_hash[0]["id"])

    # query = "SELECT * FROM users WHERE name = '#{name}'"
    # user = User.find_by_sql(query)

    # Good
    user = User.where(name: name)
    # user = User.find_by(name: name)

    if user.present?
      redirect_to user.first

INSERT INTO "users" ("name", "email", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["email", "a"], ["content", "a"], ["created_at", "2019-12-20 08:54:13.824511"], ["updated_at", "2019-12-20 08:54:13.824511"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "content" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "igads"], ["content", "ufad"], ["updated_at", "2019-12-20 11:20:53.951703"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)